In [ ]:
!pip install cassandra-driver

In [ ]:
import cassandra
print(cassandra.__version__)

In [ ]:
from cassandra.cluster import Cluster
from cassandra.auth import PlainTextAuthProvider

try:
    cloud_config= {
            'secure_connect_bundle': 'J:\Ineuron\secure-connect-sandesh007.zip'
    }
    auth_provider = PlainTextAuthProvider('SjJkSsbMHtSprEXHBnbbWcUT', '2rCxj3ln_8xflrmZg1TFBz69SmzmJcvgwmiibq7RZXjXu9kjkN_1WRPQCkDEPXR2Cjr2WnZq5k+pnISnAjn0b6FPNEjQBtzaJlazOaXwY4BuBMcA2q3J,DOWcZAcnimO')
    cluster = Cluster(cloud=cloud_config, auth_provider=auth_provider)
    session = cluster.connect()
except Exception as e:
    print('Error occurs',e)

#row = session.execute("select release_version from system.local").one()
#row =session.execute("CREATE KEYSPACE Sandesh WITH replication = {'class':'SimpleStrategy', 'replication_factor' : 3}").one()
#row=session.execute(" CREATE TABLE jonty.emp(emp_id int PRIMARY KEY,emp_name text,emp_city text,emp_sal varint,emp_phone varint);").one()
#row=session.execute("DESCRIBE Sandesh").one()

# Create a table

In [ ]:
try:
    query=("CREATE TABLE jonty.emp3(EMP_ID TEXT PRIMARY KEY,EMP_NAME TEXT,EMP_ROLE TEXT,EMP_LEVEL INT);")
    row1=session.execute(query).one()
    print('Table created')
except Exception as e:
    print("Error",e)

# Insert a row:

In [ ]:
try:
    row2=session.execute("INSERT INTO jonty.emp3(EMP_ID,EMP_NAME,EMP_ROLE,EMP_LEVEL) values('1234','Sandesh','ER.',7);")
    print(row2)
except Exception as e:
    print('Error errors',e)

# Insert more rows and output:

In [ ]:
try:
    row3= session.execute("INSERT INTO jonty.emp3(EMP_ID,EMP_NAME,EMP_ROLE,EMP_LEVEL) values('1235','Purna','Lawyer',8);")
    row3=session.execute("INSERT INTO jonty.emp3(EMP_ID,EMP_NAME,EMP_ROLE,EMP_LEVEL) values('1236','Bindu','HW',9);")
    row3=session.execute("INSERT INTO jonty.emp3(EMP_ID,EMP_NAME,EMP_ROLE,EMP_LEVEL) values('1237','Sabita','Banker',10);")
    row3=session.execute("INSERT INTO jonty.emp3(EMP_ID,EMP_NAME,EMP_ROLE,EMP_LEVEL) values('1238','Suresh','Business',11);")
    row3=session.execute("INSERT INTO jonty.emp3(EMP_ID,EMP_NAME,EMP_ROLE,EMP_LEVEL) values('1239','Deepika','Insurance',12);")
    row3=session.execute("INSERT INTO jonty.emp3(EMP_ID,EMP_NAME,EMP_ROLE,EMP_LEVEL) values('1240','Sibu','student',13);")
    row3=session.execute("INSERT INTO jonty.emp3(EMP_ID,EMP_NAME,EMP_ROLE,EMP_LEVEL) values('1241','Madan','student',14);")
    row3=session.execute("SELECT * from jonty.emp3") 
    for i in row3:
        print(i)
except Exception as e:
    print('Error errors',e)

# Get the rows count:

In [ ]:
try:
    row4=session.execute("SELECT count(*) from jonty.emp3")
    for i in row4:
        print(i)
except Exception as e:
    print('Error occurs',e)

# Add new column

In [ ]:
try:

    row4=session.execute("ALTER TABLE jonty.emp3 ADD AGE int;")
    for i in row4:
        print(i)
except Exception as e:
        print('Error occurs',e)

# Update the new column in whole table

In [ ]:
try:
    row4=session.execute("INSERT INTO jonty.emp3(EMP_ID,EMP_NAME,EMP_ROLE,EMP_LEVEL,AGE) values('1234','Sandesh','ER.',7,33);")
    row4=session.execute("INSERT INTO jonty.emp3(EMP_ID,EMP_NAME,EMP_ROLE,EMP_LEVEL,AGE) values('1235','Purna','Lawyer',8,64);")
    row4=session.execute("INSERT INTO jonty.emp3(EMP_ID,EMP_NAME,EMP_ROLE,EMP_LEVEL,AGE) values('1236','Bindu','HW',9,60);")
    row4=session.execute("INSERT INTO jonty.emp3(EMP_ID,EMP_NAME,EMP_ROLE,EMP_LEVEL,AGE) values('1237','Sabita','Banker',10,29);")
    row4=session.execute("INSERT INTO jonty.emp3(EMP_ID,EMP_NAME,EMP_ROLE,EMP_LEVEL,AGE) values('1238','Suresh','Business',11,40);")
    row4=session.execute("INSERT INTO jonty.emp3(EMP_ID,EMP_NAME,EMP_ROLE,EMP_LEVEL,AGE) values('1239','Deepika','Insurance',12,40);")
    row4=session.execute("INSERT INTO jonty.emp3(EMP_ID,EMP_NAME,EMP_ROLE,EMP_LEVEL,AGE) values('1240','Sibu','student',13,4);")
    row4=session.execute("INSERT INTO jonty.emp3(EMP_ID,EMP_NAME,EMP_ROLE,EMP_LEVEL,AGE) values('1241','Madan','student',14,12);")
    row4=session.execute("SELECT * from jonty.emp3;")
    for i in row4:
        print(i)
except Exception as e:
    print("Error occurs",e)

# To find the minimum AGE

In [ ]:
try:
    row4=session.execute("SELECT MIN(AGE) from jonty.emp3;")
    for i in row4:
        print(i)
except Exception as e:
    print("Error occurs",e)

# To find the maximum AGE of the EMP Name

In [ ]:
try:
    row4=session.execute("SELECT EMP_NAME,MAX(AGE) from jonty.emp3;")
    for i in row4:
        print(i)
except Exception as e:
    print("Error occurs",e)

# To add the income column of int type

In [ ]:
try:
    row4=session.execute("ALTER TABLE jonty.emp3 ADD income INT;")
    for i in row4:
        print(i)
except Exception as e:
    print("Error occurs",e)

In [ ]:
try:
    row4=session.execute("INSERT INTO jonty.emp3(EMP_ID,EMP_NAME,EMP_ROLE,EMP_LEVEL,AGE,INCOME) values('1234','Sandesh','ER.',7,33,25000);")
    row4=session.execute("INSERT INTO jonty.emp3(EMP_ID,EMP_NAME,EMP_ROLE,EMP_LEVEL,AGE,INCOME) values('1235','Purna','Lawyer',8,64,30000);")
    row4=session.execute("INSERT INTO jonty.emp3(EMP_ID,EMP_NAME,EMP_ROLE,EMP_LEVEL,AGE,INCOME) values('1236','Bindu','HW',9,60,5000);")
    row4=session.execute("INSERT INTO jonty.emp3(EMP_ID,EMP_NAME,EMP_ROLE,EMP_LEVEL,AGE,INCOME) values('1237','Sabita','Banker',10,29,20000);")
    row4=session.execute("INSERT INTO jonty.emp3(EMP_ID,EMP_NAME,EMP_ROLE,EMP_LEVEL,AGE,INCOME) values('1238','Suresh','Business',11,40,60000);")
    row4=session.execute("INSERT INTO jonty.emp3(EMP_ID,EMP_NAME,EMP_ROLE,EMP_LEVEL,AGE,INCOME) values('1239','Deepika','Insurance',12,40,35000);")
    row4=session.execute("INSERT INTO jonty.emp3(EMP_ID,EMP_NAME,EMP_ROLE,EMP_LEVEL,AGE,INCOME) values('1240','Sibu','student',13,4,0);")
    row4=session.execute("INSERT INTO jonty.emp3(EMP_ID,EMP_NAME,EMP_ROLE,EMP_LEVEL,AGE,INCOME) values('1241','Madan','student',14,12,0);")
    row4=session.execute("SELECT * from jonty.emp3;")
    for i in row4:
        print(i)
except Exception as e:
    print("Error occurs",e)

# To find the average of the income

In [ ]:
try:
    row4=session.execute("SELECT Avg(income) from jonty.emp3;")
    for i in row4:
        print(i[0])
except Exception as e:
    print("Error occurs",e)

# To read the  emp name from  table

In [ ]:
try:
    row4= session.execute("SELECT EMP_NAME from jonty.emp3;")
    for i in row4:
        print(i[0])
except Exception as e:
    print("Error occurs",e)

# to select distinct key element

In [ ]:
row4=session.execute("SELECT DISTINCT EMP_ID from jonty.emp3;")
for i in row4:
    print(i)

# select row using where clause

In [ ]:
try:
    row4=session.execute("SELECT EMP_NAME,AGE,INCOME from jonty.emp3 where EMP_ID ='1235';")
    for i in row4:
        print(i)
except Exception as e:
    print("Error occurs",e)

# select the row using asecending or dececnding order

In [ ]:
try:
    row4=session.execute("SELECT EMP_NAME,AGE,EMP_ROLE from jonty.emp3 ORDER BY EMP_ID DESC ALLOW FILTERING;")
    for i in row4:
        print(i)
except Exception as e:
    print("Error occurs",e)

# Drop column

In [ ]:
try:
    row4=session.execute("ALTER TABLE jonty.emp3 DROP INCOME;")
    print("INCOME column has been dropped out!")
except Exception as e:
    print("Error occurs",e)

# To display the whole table

In [ ]:
row4= session.execute("SELECT * from jonty.emp3;")
for i in row4:
    print(i)

In [ ]:
# Display employess whose emp_sal 50000 using ALLOW FILTERING;
try:
    query = "SELECT EMP_ID,EMP_NAME FROM jonty.emp3 WHERE age >30 ALLOW FILTERING"
    rows = session.execute(query)
    for row in rows:
        print(row)
except Exception as e:
    print('excetion occured ',e)